magnus_2d/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  12                                    |
|   \  /    A nd           | Website:  www.openfoam.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (20 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (20 0 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (20 0 0);
        value           uniform (20 0 0);
    }
    top
    {
        type            symmetry;
    }
    bottom
    {
        type            symmetry;
    }
    cylinder
    {
        type            rotatingWallVelocity;
        origin          (0 0 0);
        axis            (0 0 1);
        omega           -62.831853;
    }
    frontAndBack
    {
        type            empty;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
